export const userMetaData = {
  signUpPage: {
    title: '제로힙 회원가입 페이지',
    description:
      '제로힙의 회원이 되어 다양한 서비스를 이용해보세요. 새로운 계정을 생성하고 제로힙의 다양한 기능과 혜택을 경험해보실 수 있습니다.',
  },
  loginPage: {
    title: '제로힙 로그인 페이지',
    description:
      '기존에 생성한 계정으로 제로힙에 로그인하세요. 프로필 사진, 닉네임, 비밀번호를 변경할 수 있는 페이지로서 회원 정보를 손쉽게 관리할 수 있습니다.',
  },
  myPage: {
    title: '제로힙 마이 페이지',
    description:
      '내 정보를 확인하고 관리하는 제로힙 마이 페이지입니다. 프로필 사진, 닉네임, 비밀번호 변경 등 다양한 개인 정보 관리가 가능하며, 이때까지 쓴 글을 관리할 수 있습니다.',
  },
  userUpdatePage: {
    title: '제로힙 회원 정보 수정 페이지',
    description:
      '회원 정보를 업데이트하고 변경할 수 있는 페이지입니다. 프로필 사진, 닉네임, 비밀번호 변경을 통해 회원 정보를 최신 상태로 유지할 수 있습니다.',
  },
  userDeletePage: {
    title: '제로힙 회원 탈퇴 페이지',
    description:
      '제로힙 서비스를 더이상 이용하지 않을 시에 이 페이지에서 회원 탈퇴를 진행할 수 있으며, 탈퇴 시 회원 정보와 서비스 이용 기록이 모두 삭제됩니다.',
  },
  userDeleteSuccessPage: {
    title: '제로힙 회원 탈퇴 성공 페이지',
    description:
      '제로힙 회원 탈퇴가 성공적으로 완료되었습니다. 이용해 주셔서 감사합니다. 회원 탈퇴로 인해 모든 회원 정보와 서비스 이용 기록이 삭제되었습니다. 이후에 제로힙을 이용하실 때는 새로운 계정으로 가입해주세요.',
  },
};
